core/app/Http/Controllers/ApiController.php

select `name`, `price_per_k`, `min`, `max`, `details`, `id`, `api_provider_id`, `api_service_id` from `services` where `category_id` = '16'
---
    public function process_request(Request $request)
	{

            $data['services'] = Service::where("category_id",$request->cat)
            ->get(["name","price_per_k", "min", "max", "details", "id", "api_provider_id", "api_service_id"]);