core/app/Http/Controllers/Gateway/PaymentController.php

select * from `gateway_currencies` where exists (select * from `gateways` where `gateway_currencies`.`method_code` = `gateways`.`code` and `status` = 1) order by `method_code` asc
---
    public function deposit()
    {
        $gatewayCurrency = GatewayCurrency::whereHas('method', function ($gate) {
            $gate->where('status', Status::ENABLE);
        })->with('method')->orderby('method_code')->get();

insert into `deposits` (`user_id`, `method_code`, `method_currency`, `amount`, `charge`, `rate`, `final_amo`, `btc_amo`, `btc_wallet`, `trx`, `status`, `updated_at`, `created_at`) values (3, 102, 'NGN', '100', 0, 0, '100', 0, '', 'PLA-944231220055928', 2, '2023-12-20 17:59:28', '2023-12-20 17:59:28')
---
    public function depositInsert(Request $request)
    {


        $request->validate([
            'amount'      => 'required|numeric|gt:0',
        ]);


        $key = env('WEBKEY');
        $ref = trx_id();
        $email = Auth::user()->email;

        $url = "https://web.enkpay.com/pay?amount=$request->amount&key=$key&ref=$ref&email=$email";


        $data                  = new Deposit();
        $data->user_id         = Auth::id();
        $data->method_code     = 102;
        $data->method_currency = "NGN";
        $data->amount          = $request->amount;
        $data->charge          = 0;
        $data->rate            = 0;
        $data->final_amo       = $request->amount;
        $data->btc_amo         = 0;
        $data->btc_wallet      = "";
        $data->trx             = $ref;
        $data->status          = 2;

        $data->save();