core/app/Http/Controllers/Gateway/PaymentController.php

delete from `deposits` where `user_id` = 3 and `status` = 2
---
    public function depositInsert(Request $request)
    {


        $request->validate([
            'amount'      => 'required|numeric|gt:0',
        ]);


        Deposit::where('user_id', Auth::id())->where('status', 2)->delete() ?? null;