core/app/Http/Controllers/Admin/ServiceController.php

    public function index()
    {
        $pageTitle  = "Manage Service";
        $categories = Category::active()->orderBy('name')->get();
        $apiLists   = ApiProvider::active()->get();
        $services   = Service::with('category', 'provider')->searchable(['name', 'category:name'])->whereHas('category', function ($query) {
            $query->active();
        })->orderBy('name')->paginate(getPaginate());
---
select * from `api_providers` where `api_providers`.`id` in (1)
select * from `categories` where `categories`.`id` in (11, 13, 27)

    public function edit($id)
    {
        $pageTitle  = "Update Service";
        $service    = Service::findOrFail($id);
---
select * from `services` where `services`.`id` = '78' limit 1

    public function delete($id)
    {
        Service::where('id',$id)->delete();
---
delete from `services` where `id` = '89'