core/app/Http/Controllers/User/Auth/RegisterController.php

    protected function create(array $data)
    {
        $general = gs();

        //User Create
        $user = new User();
        $user->email = strtolower(trim($data['email']));
        $user->password = Hash::make($data['password']);
        $user->username = trim($data['username']);
        $user->country_code = $data['country_code'];
        $user->mobile = $data['mobile_code'] . $data['mobile'];
        $user->address = [
            'address' => '',
            'state' => '',
            'zip' => '',
            'country' => isset($data['country']) ? $data['country'] : null,
            'city' => ''
        ];
        $user->ev = $general->ev ? Status::NO : Status::YES;
        $user->sv = $general->sv ? Status::NO : Status::YES;
        $user->ts = 0;
        $user->tv = 1;
        $user->save();


        $adminNotification = new AdminNotification();
        $adminNotification->user_id = $user->id;
        $adminNotification->title = 'New member registered';
        $adminNotification->click_url = urlPath('admin.users.detail', $user->id);
        $adminNotification->save();
---
insert into `users` (`email`, `password`, `username`, `country_code`, `mobile`, `address`, `ev`, `sv`, `ts`, `tv`, `updated_at`, `created_at`) values ('toluadejimi@gmail.com', '$2y$10$pR9BL0h4TVTC23lAQl5xbuXsTjqa3VS4rIuFOL2tt8VZ7c8zdZZsC', 'jimmy', 234, 0, '{\"address\":\"\",\"state\":\"\",\"zip\":\"\",\"country\":null,\"city\":\"\"}', 0, 1, 0, 1, '2023-12-20 11:03:48', '2023-12-20 11:03:48')
insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (2, 'New member registered', '/admin/users/detail/2', '2023-12-20 11:03:48', '2023-12-20 11:03:48')


        //Login Log Create
        $ip = getRealIP();
        $exist = UserLogin::where('user_ip', $ip)->first();
---
select * from `user_logins` where `user_ip` = '127.0.0.1' limit 1


        $userLogin->browser = @$userAgent['browser'];
        $userLogin->os      = @$userAgent['os_platform'];
        $userLogin->save();
---
insert into `user_logins` (`longitude`, `latitude`, `city`, `country_code`, `country`, `user_id`, `user_ip`, `browser`, `os`, `updated_at`, `created_at`) values ('', '', '', '', '', 2, '127.0.0.1', 'Chrome', 'Mac OS X', '2023-12-20 11:03:48', '2023-12-20 11:03:48')